<script setup>
const goBack = () => window.history.back();
</script>
<template>
  <div class="common-layout">
    <el-container>
      <el-header class="header-box">
        <button @click="goBack">◀ GoBack</button>
        小鱼儿🏠の用户协议💻
        <span style="font-size: 18px; position: fixed; right: 10px; top: 10px"
          >更新人名：xiaoyuer</span
        >
        <span style="font-size: 18px; position: fixed; right: 10px; top: 35px"
          >更新时间：2023年8月14日</span
        >
      </el-header>
      <el-main class="main-box">
        <div style="margin-bottom: 15px; margin-top: 20px; font-size: larger">
          🐟导言:
        </div>
        欢迎来到🐟小鱼儿の🏠！在进入🏠之前，请仔细阅读以下内容并同意本用户协议。
        由本小🐟の好朋友小🐱带领十二生肖为大家一一介绍一下该用户协议，大家掌声欢迎！！！

        <h1>🐀定义及服务说明</h1>
        <p>
          我们提供项目の后台管理⚙服务，具体内容可参考产品介绍或其他相关文档。
          我们将尽力为您提供良好的服务质量，但不承担因技术等原因产生的任何损失或责任。
        </p>

        <h1>🐂您的账号</h1>
        <p>
          您需要创建一个用户账户以使用我们的服务。在注册时,
          您应当提供真实的个人信息，同时妥善保管账户及密码，
          并对账户中产生的所有行为负责。如果您发现有任何未经授权使用您账户的情况，
          请立即联系我们。我们不承担您因未能妥善保管账户信息而产生的任何损失或责任。
        </p>

        <h1>🐅使用限制</h1>
        <p>
          您了解并同意，您只能在遵守所有适用法律和法规的前提下使用我们的服务。
          您不得利用我们的服务从事非法活动，包括但不限于：
          1.发布、传播、储存或者分享任何违反法律规定或公序良俗的内容；<br />
          2.通过我们的服务侵犯他人的知识产权或其他合法权利；<br />
          3.破坏、攻击、篡改或者盗取我们的系统、软件、数据或服务；<br />
          4.违反本协议或我们发布的其他规定。
        </p>

        <h1>🐇免责声明</h1>
        <p>
          我们将尽力保障我们的服务的稳定性和安全性，但不能确保我们的服务的完全无误、不中断或不受攻击。
          因我们的服务可能存在的技术故障、系统维护等原因而导致的服务中断或信息泄漏等情况，
          我们不承担任何责任。
        </p>

        <h1>🐉协议变更</h1>
        <p>
          我们有权根据业务需要或相关法律法规的变化随时修改本协议。
          我们会在修改生效前通过适当方式向您进行通知，并发布最新的协议文本。
          如果您不同意修改后的协议，您应当立即停止使用我们的服务。
        </p>

        <h1>🐍法律适用</h1>
        <p>
          本协议的效力、解释和纠纷解决均应适用中华人民共和国法律。
          如本协议中的任何条款与适用法律相抵触，应以法律规定为准。
        </p>

        <h1>🐎争议解决</h1>
        <p>
          本协议履行过程中发生的争议，双方应先通过友好协商解决；协商不成的，
          任何一方可向协议签订地有管辖权的人民法院提起诉讼。
        </p>

        <h1>🐏服务使用规则</h1>
        <p>
          1.遵守中国有关的法律和法规及其他规范性文件;<br />
          2.不得为任何非法目的而使用网络服务系统；<br />
          3. 遵守所有与网络服务有关的网络协议、规定和程序；<br />
          4.不得利用力扣网络服务系统进行任何可能对互联网的正常运转造成不利影响的行为；<br />
          5.不得利用力扣网络服务系统传输任何骚扰性的、中伤他人的、辱骂性的、恐吓性的、庸俗淫秽的或其他任何非法的信息资料；
        </p>

        <h1>🐒信息内容规范</h1>
        <p>
          若出现以下违法、不良信息或存在危害的行为，将会对其进行处理（账号封禁），必要时联系相关人员进行处理：<br />
          1.危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一，损害国家荣誉和利益；<br />
          2.侮辱、滥用英烈形象，歪曲、丑化、亵渎、否定英雄烈士事迹和精神，以侮辱、诽谤或者其他方式侵害英雄烈士的姓名、肖像、名誉、荣誉；<br />
          3.宣扬恐怖主义、极端主义或者煽动实施恐怖活动、极端主义活动；<br />
          4.煽动民族仇恨、民族歧视，破坏民族团结；<br />
          5.破坏国家宗教政策，宣扬邪教和封建迷信；<br />
          6.散布谣言，扰乱社会秩序，破坏社会稳定；<br />
          7.宣扬淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪；<br />
          8.煽动非法集会、结社、游行、示威、聚众扰乱社会秩序；<br />
          9.侮辱或者诽谤他人，侵害他人名誉、隐私和其他合法权益；<br />
        </p>

        <h1>🐓内容上传、分享与所有权</h1>
        <p>
          您充分了解并同意，我们提供的用户上传、分享、传播信息平台仅用于用户上传、分享、传送及获取信息，
          该平台或通过该平台所传送的任何内容并不反应我们的观点或政策，我们对此不承担任何责任。
          同时，您应对该平台的其他用户提供的内容自行加以判断，并承担因使用该内容而引起的所有风险，
          包括因对内容的正确性、完整性或实用性的依赖而产生的风险，我们对此不承担任何法律责任。
          您在我们平台上传、发布或传输图片、文字、音频、视频等内容即视为您是前述内容的著作权人或合法授权人。
          除双方另有约定外，您在使用平台时将前述内容公开发布、传播、分享的行为代表了
          您有权且同意在全世界范围内、永久性的、不可撤销的、免费的
          授予我们可对该等内容行使除专属于著作权人的人身权利以外的全部著作权权利
          （包括但不限于复制、发行、出租、展览、表演、放映、传播、摄制、改编、翻译、汇编您的内容，
          与上述权利相关的商业开发、宣传和推广等服务的权利，含转授权及维权权利）。
        </p>

        <h1>🐕通知与送达</h1>
        <p>
          本协议项下的所有通知和公告，我们将通过网页公告、推送通知、电子邮件或短信等方式进行。
          这些通知和公告自发布之日视为已经送达。
        </p>

        <h1>🐖其他规定</h1>
        <p>
          1.我们可能会随时更新本《用户协议》的内容，该等更新构成本《用户协议》的一部分。
          我们将在本协议生效前通过发布页面通知、弹窗、站内信或以其他方式通知您，在您继续使用我们的产品及/或服务前，
          请仔细阅读本协议的更新版本。若您不同意变更后的内容，您可以选择停止使用我们的产品/或服务，
          若您继续使用我们的产品及/或服务，即表示您充分阅读、理解并同意接受经修订的《用户协议》的约束。
          更新后的协议于协议更新之日起生效。<br />
          2.如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，本协议的其余条款仍应有效并且有约束力。<br />
          3.本协议中的标题仅为方便而设，不具法律或契约效果。
        </p>
        <br />
        <h1>🐱最后，感谢您的信任和支持！</h1>
        <h5>ps:若您有更好的意见,请放送您的意见至我的邮箱,如下所示👇</h5>
      </el-main>
      <div class="footer-box">
        <span>Copyright © 2023-2024 xiaoyuer🐟🐱</span>
        <span style="top: 50px">
          🐱(o=^•ェ•)o🐟...上班摸鱼中 &nbsp;&nbsp;📫:ydg_0814@qq.com
        </span>
      </div>
    </el-container>
  </div>
</template>

<style lang="scss" scoped>
.header-box {
  text-align: center;
  font-size: 35px;
  box-shadow: 0 2px 20px rgba(202, 208, 217, 0.6);
  button {
    position: absolute;
    left: 0;
    margin: 10px;
    border-radius: 4px;
    font-size: 2rem;
    color: #fff;
    background-color: #42b983;
    border: none;
    cursor: pointer;
    transition: all 0.3s ease;
  }
  button:hover {
    background-color: #34a672;
  }
}
.main-box {
  position: absolute;
  left: 15%;
  right: 15%;
  top: 10%;
  bottom: 15%;
  font-size: 20px;
}
.footer-box {
  position: absolute;
  bottom: 0;
  width: 100%;
  height: 80px;
  box-shadow: 0 2px 20px rgba(202, 208, 217, 0.6);
  span {
    position: absolute;
    text-align: center;
    top: 15px;
    left: 10%;
    right: 10%;
  }
}
h1 {
  margin: 20px;
  margin-left: 0;
}
</style>
